const kakao_ak = "KakaoAK 2223d3c0765e40d0ff687f4df91f5bde";
const CLOSE = 0;
const OPEN = 1;
const OFF = 0;
const ON = 1;
//프로그램 리스트
// const PROGRAM_CATEGORY = {
//     TR:{name:"스포츠",
//         sub_category:{
//             WT:{name:"웨이트 트레이닝"},
//             PI:{name:"필라테스"},
//             YG:{name:"요가"},
//             BL:{name:"발레"},
//             GOLF:{name:"골프"},
//             TENNIS:{name:"테니스"},
//             BILLIARD:{name:"당구"},
//             SPINNING:{name:"스피닝"},
//             MARTIALARTS:{name:"격투기"},
//             RUNNING:{name:"런닝/마라톤"},
//             BOXING:{name:"복싱"},
//             SPORTSRECOVERY:{name:"스포츠 재활"},
//             MEDITATION:{name:"명상"},
//             BOOTCAMP:{name:"고강도 트레이닝"},
//             ROWING:{name:"로잉"},
//             CYCLING:{name:"싸이클"},
//             DANCE:{name:"댄스"},
//             OUTDOOR:{name:"아웃도어"},
//             // CUPPING:{name:"부황"},
//             // FACIAL:{name:"얼굴 마사지"},
//             // MASSAGE:{name:"마사지"},
//             // CRYOTHERAPY:{name:"냉동/한랭요법"},
//             // ACUPUNCTURE:{name:"침술"},
//             // BEAUTY:{name:"beauty"},
//             SPORTS:{name:"스포츠"},
//             ENTRANCEEXAMINATION:{name:"입시"},
//         }
//     },
//     // MU:{name:"음악", 
//     //     sub_category:{
//     //         PIANO:{name:"피아노"},
//     //         FLUTE:{name:"플룻"},
//     //         VIOLIN:{name:"바이올린"},
//     //         CELLO:{name:"첼로"},
//     //         // VOCAL_MUSIC:{name:"성악"},
//     //         // CLARINET:{name:"클라리넷"},
//     //         GUITAR:{name:"기타"},
//     //         DRUM:{name:"드럼"},
//     //         VOCAL:{name:"보컬"},
//     //         COMPOSITION:{name:"작곡"}
//     //     }
//     // },
//     // PL:{name:"과외", 
//     //     sub_category:{
//     //         KO:{name:"국어"},
//     //         EG:{name:"영어"},
//     //         EG_CM:{name:"영어회화"},
//     //         MA:{name:"수학"},
//     //         CH:{name:"중국어"},
//     //         CH_CM:{name:"중국어 회화"},
//     //         JP:{name:"일본어"},
//     //         JP_CM:{name:"일본어 회화"},
//     //         SCIENCE:{name:"과학"}
//     //     }
//     // },
//     // ETC:{name:"기타",
//     //     sub_category:{
//     //         ETC:{name:"기타"}
//     //     }},
// };

const PROGRAM_CATEGORY = {
    GOLF:{name:"골프",
        sub_category:{
            OUTDOOR:{name:"실외 연습장"},
            INDOOR:{name:"실내 연습장"},
            STUDIO:{name:"전문 스튜디오"},
            SCREEN:{name:"스크린골프"}
        }
    }
};

const REGION_KR = {
    SEOUL:{
        name:"서울특별시",
        gu:["종로구", "중구", "용산구", "성동구", "광진구", "동대문구", "중랑구", "성북구", "강북구", "도봉구", "노원구", "은평구", "서대문구", "마포구", "양천구", "강서구", "구로구", "금천구", "영등포구", "동작구", "관악구", "서초구", "강남구", "송파구", "강동구"]
    },
    BUSAN:{
        name:"부산광역시",
        gu:["중구", "서구", "동구", "영도구", "부산진구", "동래구", "남구", "북구", "강서구", "해운대구", "사하구", "금정구", "연제구", "수영구", "사상구", "기장군"]
    },
    INCHEON:{
        name:"인천광역시",
        gu:["중구", "동구", "남구", "연수구", "남동구", "부평구", "계양구", "서구", "강화군", "옹진군"]
    },
    DAEGU:{
        name:"대구광역시",
        gu:["중구", "동구", "서구", "남구", "북구", "수성구", "달서구", "달성군"]
    },
    GWANGJU:{
        name:"광주광역시",
        gu:["동구", "서구", "남구", "북구", "광산구"]
    },
    DAEJEON:{
        name:"대전광역시",
        gu:["동구", "중구", "서구", "유성구", "대덕구"]
    },
    ULSAN:{
        name:"울산광역시",
        gu:["중구", "남구", "동구", "북구", "울주군"]
    },
    SEJONG:{
        name:"세종특별자치시",
        gu:[]
    },
    GYEONGGI:{
        name:"경기도",
        gu:["가평군", "고양시", "과천시", "광명시", "광주시", "구리시", "군포시", "김포시", "남양주시", "동두천시", "부천시", "성남시", "수원시", "시흥시", "안산시", "안성시", "안양시", "양주시", "양평군", "여주시", "연천군", "오산시", "용인시", "의왕시", "의정부시", "이천시", "파주시", "평택시", "포천시", "하남시", "화성시"]
    },
    GANGWON:{
        name:"강원도",
        gu:["원주시", "춘천시", "강릉시", "동해시", "속초시", "삼척시", "홍천군", "태백시", "철원군", "횡성군", "평창군", "영월군", "정선군", "인제군", "고성군", "양양군", "화천군", "양구군"]
    },
    CHUNGBUK:{
        name:"충청북도",
        gu:["청주시", "충주시", "제천시", "보은군", "옥천군", "영동군", "증평군", "진천군", "괴산군", "음성군", "단양군"]
    },
    CHUNGNAM:{
        name:"충청남도",
        gu:["천안시", "공주시", "보령시", "아산시", "서산시", "논산시", "계룡시", "당진시", "금산군", "부여군", "서천군", "청양군", "홍성군", "예산군", "태안군"]
    },
    GYEONGBUK:{
        name:"경상북도",
        gu:["포항시", "경주시", "김천시", "안동시", "구미시", "영주시", "영천시", "상주시", "문경시", "경산시", "군위군", "의성군", "청송군", "영양군", "영덕군", "청도군", "고령군", "성주군", "칠곡군", "예천군", "봉화군", "울진군", "울릉군"]
    },
    GYEONGNAM:{
        name:"경상남도",
        gu:["창원시", "김해시", "진주시", "양산시", "거제시", "통영시", "사천시", "밀양시", "함안군", "거창군", "창녕군", "고성군", "하동군", "합천군", "남해군", "함양군", "산청군", "의령군"]
    },
    JEONBUK:{
        name:"전라북도",
        gu:["전주시", "익산시", "군산시", "정읍시", "완주군", "김제시", "남원시", "고창군", "부안군", "임실군", "순창군", "진안군", "장수군", "무주군"]
    },
    JEONNAM:{
        name:"전라남도",
        gu:["여수시", "순천시", "목포시", "광양시", "나주시", "무안군", "해남군", "고흥군", "화순군", "영암군", "영광군", "완도군", "담양군", "장성군", "보성군", "신안군", "장흥군", "강진군", "함평군", "진도군", "곡성군", "구례군"]
    },
    JEJU:{
        name:"제주특별자치도",
        gu:["제주시", "서귀포시"]
    }
}



export {kakao_ak, CLOSE, OPEN, OFF, ON, PROGRAM_CATEGORY, REGION_KR};